import React from "react";

const Mokdata = (div) => {
  return (
    <div>
      분자, 원자, 전자, 소립자 등 미시적인 계의 현상을 다루는 즉, 작은 크기를
      갖는 계의 현상을 연구하는 물리학의 분야이다. 또는 아원자 입자 및 입자
      집단을 다루는 현대 물리학의 기초 이론이다. '아무리 기이하고 터무니없는
      사건이라 해도, 발생 확률이 0이 아닌 이상 반드시 일어난다'는 물리학적
      아이디어에 기초한다.[1] 양자역학의 양자는 물리량에 기본 단위가 있으며, 그
      기본 단위에 정수배만 존재한다는 뜻을 담고 있다. 현대 물리학의 기초인
      양자역학은 컴퓨터의 주요 부품인 반도체의 원리를 설명해 주고, "물질의
      운동이 본질적으로 비결정론적인가?" 라는 의문을 제기하며 과학기술, 철학,
      문학, 예술 등 다방면에 중요한 영향을 미쳐 20세기 과학사에서 빼놓을 수 없는
      중요한 이론으로 평가된다.[2][3] 19세기 중반까지의 실험은 뉴턴의
      고전역학으로 설명할 수 있었다. 그러나, 19세기 후반부터 20세기 초반까지
      이루어진 전자, 양성자, 중성자 등의 아원자 입자와 관련된 실험들의 결과는
      고전역학으로 설명을 시도할 경우 모순이 발생하여 이를 해결하기 위한 새로운
      역학 체계가 필요하게 되었다. 이 양자역학은 플랑크의 양자 가설을 계기로
      하여 슈뢰딩거, 하이젠베르크, 디랙 등에 의해 만들어진 전적으로 20세기에
      이루어진 학문이다. 양자역학에서 플랑크 상수를 0으로 극한을 취하면
      양자역학이 고전역학으로 수렴하는데, 이를 대응 원리라 한다. 미시세계를
      탐구하는 양자역학에서 물리량은 기본적으로 불연속적이다. 이와는 반대로
      거시세계를 탐구하는 고전역학에서 물리량은 연속적이였다. 다루는 이는 관찰
      기준의 차이이다. 이해를 돕기 위한 간단한 비유로 우리가 모래사장을 멀리서
      바라본다고 하면 이는 우리가 물리현상을 거시세계에서 보는 것이라고 할 수
      있다. 이 관찰에서 모래사장의 표면은 연속적으로 보인다. 이는 거시세계에서
      우리가 관찰하는 물리현상에서 물리량이 연속적으로 관찰된다는 것에 비유된다.
      만약 우리가 점점 모래사장에 가까이 다가가 모래사장을 관찰한다면 이는
      거시세계에서 미시세계로 관찰의 단위를 줄인 것이다. 모래사장 가까이서
      모래사장을 관찰한다면 모래사장의 표면은 불연속적으로 관찰 될 것이다. 이는
      미시세계에서 물리현상에 물리량이 불연속적으로 관찰 된다는 것과 비슷하다.
      즉, 거시세계에서 특정 물리량을 관찰하면 그 물리량의 불연속성이 미시세계의
      관찰 기준에 비해 너무 미세해 마치 그것이 연속적인 것처럼 보이지만, 관찰
      단위가 거시세계보다 작은 미시세계에서 대상을 관찰하면 그 불연속성이
      보이더라'라는 것이다. 양자역학은 모든 역학, 전자기학(일반 상대성 이론은
      제외)을 포함하는 고전 이론을 일반화한다. 양자역학은 고전역학으로 설명되지
      않는 현상에 대한 정확한 설명을 제공한다. 양자역학의 효과는 거시적으로는
      관측이 어렵지만[4] 고체의 성질을 연구하는 과정에서 양자역학 개념이
      필수적이다. 예를 들어 드하스-판알펜 효과는 양자역학을 통해서만 설명이
      가능하다. 물론, 원자 또는 그보다 작은 영역에서는 분명해진다.
      양자역학이라는 용어는 독일의 물리학자 막스 보른(Max Born, 1882~1970)이
      처음 제시했다. 독일어 'Quantenmechanik(퀀텐메카닉)'이 영어 'Quantum
      mechanics'로 번역되었고 일본에서 이를‘量子力學(료오시리키가쿠)’라
      번역했는데 이것이 한국에 그대로 들어와 ‘양자역학'이라 부르게 되었다.
      양자역학이란 말을 이해하려면 ‘양자’와 ‘역학’을 각각 살펴보는 것이 좋다.
      ‘양자(量子)’로 번역된 영어의 quantum은 양을 의미하는 quantity에서 온 말로,
      무엇인가 띄엄띄엄 떨어진 양으로 있는 것을 가리키는 말이다. ‘역학(力學)’은
      말 그대로는 ‘힘의 학문’이지만, 실제로는 ‘이러저러한 힘을 받는 물체가 어떤
      운동을 하게 되는지 밝히는 물리학의 한 이론’이라고 할 수 있다. 간단히 말해
      ‘힘과 운동’의 이론이다. 이렇듯 양자역학이란 띄엄띄엄 떨어진 양으로 있는
      것이 이러저러한 힘을 받으면 어떤 운동을 하게 되는지 밝히는 이론이라고 할
      수 있다
    </div>
  );
};

export default Mokdata;
